prompt = 'Я отправлю тебе фотографию, твоя задача сгенерировать ироничную фразу используя контекст фотографии по типу "Я еду на работу, пока все смотрят Nornikel digital week". Фраза должна заканчиваться на "Пока все смотрят Nornikel digital week" и должна быть достаточно короткой, ответь только этой фразой ничего больше не пиши. Фраза ни в коем случае не должна осквернять или быть негативный в сторону Норникеля. Фраза должна быть позитивной.'

intro = '''Я работаю на основе нейросетей.
Умею считывать информацию с фото и генерировать автоматически подписи. И готов визуализирровать технологии будущего, которые придумаем вместе с тобой.'''

choose='Давай выберем с чего начнем'
choose_buttons = ['Конкурс на лучшую подпись', 'Конкурс на лучший дизайн']

description_gen_welcome = "Загрузи любую фотографию или сделай селфи, а я автоматически сгенериирую тебе картинку с подпись."
image_gen_welcome = "Я предложу тебе случайную проблему из будущего. Опиши текстом технологию, которая поможет ее решить. А ее представлю как это будет выглядеть"
