prompt = 'Я отправлю тебе фотографию, твоя задача сгенерировать ироничную фразу используя контекст фотографии по типу «Еду грустный на работу, пока все смотрят Nornikel digital week". Фраза должна заканчиваться на "Пока все смотрят Nornickel digital week», текст до запятой, который ты генерируешь недолжен быть длиннее 5 слов. ответь только этой фразой, ничего больше не пиши. Фраза ни в коем случае не должна осквернять или быть негативной в сторону Норникеля. Фраза должна быть позитивной и смешной. Шутка должна быть остроумной, можно использовать сленг или тексты из мемов, можно использовать каламбуры, может звучать как афоризм. Используй метафоры или слова из песен, сравнивай с персонажами, будь колким и нетипичным'

intro = '''Я работаю на основе нейросетей.
Умею считывать информацию с фото и генерировать автоматически подписи. И готов визуализирровать технологии будущего, которые придумаем вместе с тобой.'''

choose='Давай выберем с чего начнем'
choose_buttons = ['Конкурс на лучшую подпись', 'Конкурс на лучший дизайн']

description_gen_welcome = "Загрузи любую фотографию или сделай селфи, а я автоматически сгенериирую тебе картинку с подпись."
image_gen_welcome = "Я предложу тебе случайную проблему из будущего. Опиши текстом технологию, которая поможет ее решить. А ее представлю как это будет выглядеть"

not_a_member = "Чтобы воспользоваться ботом, пожалуйста, вступите в канал https://t.me/+F2YJxYvkT7owMDZk. Туда будут присылать результаты все участники, а вы сможете проголосовать за самые остроумные результаты!"
not_a_member_button = 'Я вступил в канал'


problems_descriptions = [
    '"Только вверх": Небоскребы стремятся всё выше и выше, а количество окон, которые нужно мыть растут ещё быстрее! Опиши способ, который поможет чистильщикам окон справится с этой проблемой в будующем.',
    '"Зарядка для смартфонов": Современные смартфоны стали намного мощнее, но их батареи всё ещё разряжаются слишком быстро. Опиши способ, который в будущем поможет заряжать смартфон, даже если ты находишься в лесу или под водой.',
    '"Мусорные контейнеры": Мусорные баки всегда оказываются переполненными в самый неподходящий момент. Как в будущем можно будет автоматизировать процесс сбора мусора, чтобы его увозили в идеальный момент?',
    '"Очереди в супермаркете": Люди всё ещё стоят в очередях в супермаркетах, теряя драгоценное время. Опиши систему будущего, которая избавит покупателей от очередей и позволит завершить покупки за считанные секунды.',
    '"Дождливая погода": Постоянно приходится носить зонт, но он занимает много места и легко ломается на ветру. Предложи инновационный способ защиты от дождя, который станет трендом будущего.',
    '"Транспортировка грузов": Пригородные дороги часто загружены грузовиками, доставляющими товары в магазины. Как можно изменить систему доставки товаров в будущем, чтобы избежать перегруженных дорог и ускорить процесс?',
    '"Сухая одежда": После стирки одежда долго сохнет, а сушилки часто портят ткань. Предложи решение, которое позволит высушивать одежду в течение одной минуты, не нанося ей вреда.',
    '"Опоздания на работу": Люди часто опаздывают из-за проблем с транспортом или будильниками. Придумай способ, который позволит человеку всегда прибывать на работу вовремя, независимо от обстоятельств.',
    '"Хранение продуктов": Продукты в холодильнике имеют ограниченный срок годности и часто портятся. Опиши технологию, которая поможет хранить продукты свежими гораздо дольше и предотвратит их порчу.',
    '"Глобальное охлаждение": В жаркую погоду кондиционеры спасают от жары, но они тратят много энергии. Предложи способ будущего, который позволит охлаждать помещение без лишних затрат электричества и вреда для окружающей среды.',
    '"Садоводство в квартирах": В городах всё больше людей хотят выращивать растения у себя дома, но не у всех есть условия и знания для этого. Какую технологию будущего можно внедрить, чтобы каждый смог вырастить сад прямо у себя в квартире?'
    ]
